# Rebar Bar Type Set Crank Length Method

Source: https://www.revitapidocs.com/2026/9a0cf9f4-2191-475c-3fc3-af432bcde8a5.htm

---

| Rebar Bar Type Set Crank Length Method |
| --- |

Sets the crank length for the specified Rebar Crank Type.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetCrankLength(
	ElementId rebarCrankTypeId,
	double length
)
```

```
Public Sub SetCrankLength (
	rebarCrankTypeId As ElementId,
	length As Double
)
```

```
public:
void SetCrankLength(
	ElementId^ rebarCrankTypeId,
	double length
)
```

```
member SetCrankLength :
        rebarCrankTypeId : ElementId *
        length : float -> unit
```

#### Parameters

rebarCrankTypeId ElementId
:   The Rebar Crank Type id.
 Interactions with Rebar Crank Types can be done with the functions in \[!:Autodesk::Revit::DB::Structure::RebarCrankTypeUtils] .

length Double
:   The new value of the crank length.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST\_RebarCrankType category.  \-or\-  For the specified Rebar Crank Type is auto calculated and the cannot be manually set. |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | The given value for length must be positive. |

See Also

#### Reference

RebarBarType Class Autodesk.Revit.DB.Structure Namespace